/* automatically generated by rust-bindgen 0.56.0 */

pub const SPICE_ERROR_LMSGLN: u32 = 1841;
pub const SPICE_ERROR_SMSGLN: u32 = 26;
pub const SPICE_ERROR_XMSGLN: u32 = 81;
pub const SPICE_ERROR_MODLEN: u32 = 33;
pub const SPICE_ERROR_MAXMOD: u32 = 100;
pub const SPICE_ERROR_TRCLEN: u32 = 3696;
pub const SPICE_EK_CNAMSZ: u32 = 32;
pub const SPICE_EK_CSTRLN: u32 = 33;
pub const SPICE_EK_TNAMSZ: u32 = 64;
pub const SPICE_EK_TSTRLN: u32 = 65;
pub const SPICE_EK_MXCLSG: u32 = 100;
pub const SPICE_EK_TYPLEN: u32 = 4;
pub const SPICE_EK_MAXQRY: u32 = 2000;
pub const SPICE_EK_MAXQSEL: u32 = 50;
pub const SPICE_EK_MAXQTAB: u32 = 10;
pub const SPICE_EK_MAXQCON: u32 = 1000;
pub const SPICE_EK_MAXQJOIN: u32 = 10;
pub const SPICE_EK_MAXQJCON: u32 = 100;
pub const SPICE_EK_MAXQORD: u32 = 10;
pub const SPICE_EK_MAXQTOK: u32 = 500;
pub const SPICE_EK_MAXQNUM: u32 = 100;
pub const SPICE_EK_MAXQCLN: u32 = 2000;
pub const SPICE_EK_MAXQSTR: u32 = 1024;
pub const SPICE_EK_VARSIZ: i32 = -1;
pub const SPICE_NFRAME_NINERT: u32 = 21;
pub const SPICE_NFRAME_NNINRT: u32 = 106;
pub const SPICE_FRMTYP_INERTL: u32 = 1;
pub const SPICE_FRMTYP_PCK: u32 = 2;
pub const SPICE_FRMTYP_CK: u32 = 3;
pub const SPICE_FRMTYP_TK: u32 = 4;
pub const SPICE_FRMTYP_DYN: u32 = 5;
pub const SPICE_FRMTYP_ALL: i32 = -1;
pub const SPICE_CELL_CTRLSZ: u32 = 6;
pub const SPICE_GF_NWMAX: u32 = 15;
pub const SPICE_GF_NWDIST: u32 = 5;
pub const SPICE_GF_NWILUM: u32 = 5;
pub const SPICE_GF_NWSEP: u32 = 5;

pub const SPICE_DSK02_KWVXPS: u32 = 6;
pub const SPICE_DSK02_KWVXLS: u32 = 7;
pub const SPICE_DSK02_KWVTLS: u32 = 8;
pub const SPICE_DSK02_KWPLAT: u32 = 9;
pub const SPICE_DSK02_KWVXPT: u32 = 10;
pub const SPICE_DSK02_KWVXPL: u32 = 11;
pub const SPICE_DSK02_KWVTPT: u32 = 12;
pub const SPICE_DSK02_KWVTPL: u32 = 13;
pub const SPICE_DSK02_KWCGPT: u32 = 14;
pub const SPICE_DSK02_KWDSC: u32 = 15;
pub const SPICE_DSK02_KWVTBD: u32 = 16;
pub const SPICE_DSK02_KWVXOR: u32 = 17;
pub const SPICE_DSK02_KWVXSZ: u32 = 18;
pub const SPICE_DSK02_KWVERT: u32 = 19;
pub const SPICE_DSKXSI_DCSIZE: u32 = 1;
pub const SPICE_DSKXSI_ICSIZE: u32 = 1;
pub const SPICE_DSK_KEYXFR: u32 = 1;
pub const SPICE_DSK_KEYSGR: u32 = 2;
pub const SPICE_DSK_KEYSPM: u32 = 3;
pub const SPICE_DSK_KEYPTM: u32 = 4;
pub const SPICE_DSK_KEYAMG: u32 = 5;
pub const SPICE_DSK_KEYLAL: u32 = 6;
pub const SPICE_SRF_SFNMLN: u32 = 37;
pub const SPICE_SRF_MAXSRF: u32 = 100;
pub const SPICE_OSCLTX_NELTS: u32 = 20;
pub type SpiceChar = ::std::os::raw::c_char;
pub type SpiceDouble = f64;
pub type SpiceFloat = f32;
pub type SpiceInt = ::std::os::raw::c_int;
pub type ConstSpiceChar = ::std::os::raw::c_char;
pub type ConstSpiceDouble = f64;
pub type ConstSpiceInt = ::std::os::raw::c_int;
pub type SpiceLong = ::std::os::raw::c_long;
pub type SpiceShort = ::std::os::raw::c_short;
pub type SpiceUChar = ::std::os::raw::c_uchar;
pub type SpiceUInt = ::std::os::raw::c_uint;
pub type SpiceULong = ::std::os::raw::c_ulong;
pub type SpiceUShort = ::std::os::raw::c_ushort;
pub type SpiceSChar = ::std::os::raw::c_schar;
pub type SpiceBoolean = ::std::os::raw::c_int;
pub type ConstSpiceBoolean = ::std::os::raw::c_int;
pub const _Spicestatus_SPICEFAILURE: _Spicestatus = -1;
pub const _Spicestatus_SPICESUCCESS: _Spicestatus = 0;
pub type _Spicestatus = ::std::os::raw::c_int;
pub use self::_Spicestatus as SpiceStatus;
pub const _SpiceDataType_SPICE_CHR: _SpiceDataType = 0;
pub const _SpiceDataType_SPICE_DP: _SpiceDataType = 1;
pub const _SpiceDataType_SPICE_INT: _SpiceDataType = 2;
pub const _SpiceDataType_SPICE_TIME: _SpiceDataType = 3;
pub const _SpiceDataType_SPICE_BOOL: _SpiceDataType = 4;
pub type _SpiceDataType = ::std::os::raw::c_uint;
pub use self::SpiceDataType as SpiceEKDataType;
pub use self::_SpiceDataType as SpiceDataType;
pub const _SpiceEKExprClass_SPICE_EK_EXP_COL: _SpiceEKExprClass = 0;
pub const _SpiceEKExprClass_SPICE_EK_EXP_FUNC: _SpiceEKExprClass = 1;
pub const _SpiceEKExprClass_SPICE_EK_EXP_EXPR: _SpiceEKExprClass = 2;
pub type _SpiceEKExprClass = ::std::os::raw::c_uint;
pub use self::_SpiceEKExprClass as SpiceEKExprClass;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SpiceEKAttDsc {
    pub cclass: SpiceInt,
    pub dtype: SpiceEKDataType,
    pub strlen: SpiceInt,
    pub size: SpiceInt,
    pub indexd: SpiceBoolean,
    pub nullok: SpiceBoolean,
}
#[test]
fn bindgen_test_layout__SpiceEKAttDsc() {
    assert_eq!(
        ::std::mem::size_of::<_SpiceEKAttDsc>(),
        24usize,
        concat!("Size of: ", stringify!(_SpiceEKAttDsc))
    );
    assert_eq!(
        ::std::mem::align_of::<_SpiceEKAttDsc>(),
        4usize,
        concat!("Alignment of ", stringify!(_SpiceEKAttDsc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceEKAttDsc>())).cclass as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceEKAttDsc),
            "::",
            stringify!(cclass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceEKAttDsc>())).dtype as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceEKAttDsc),
            "::",
            stringify!(dtype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceEKAttDsc>())).strlen as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceEKAttDsc),
            "::",
            stringify!(strlen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceEKAttDsc>())).size as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceEKAttDsc),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceEKAttDsc>())).indexd as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceEKAttDsc),
            "::",
            stringify!(indexd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceEKAttDsc>())).nullok as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceEKAttDsc),
            "::",
            stringify!(nullok)
        )
    );
}
pub type SpiceEKAttDsc = _SpiceEKAttDsc;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SpiceEKSegSum {
    pub tabnam: [SpiceChar; 65usize],
    pub nrows: SpiceInt,
    pub ncols: SpiceInt,
    pub cnames: [[SpiceChar; 33usize]; 100usize],
    pub cdescrs: [SpiceEKAttDsc; 100usize],
}
#[test]
fn bindgen_test_layout__SpiceEKSegSum() {
    assert_eq!(
        ::std::mem::size_of::<_SpiceEKSegSum>(),
        5776usize,
        concat!("Size of: ", stringify!(_SpiceEKSegSum))
    );
    assert_eq!(
        ::std::mem::align_of::<_SpiceEKSegSum>(),
        4usize,
        concat!("Alignment of ", stringify!(_SpiceEKSegSum))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceEKSegSum>())).tabnam as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceEKSegSum),
            "::",
            stringify!(tabnam)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceEKSegSum>())).nrows as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceEKSegSum),
            "::",
            stringify!(nrows)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceEKSegSum>())).ncols as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceEKSegSum),
            "::",
            stringify!(ncols)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceEKSegSum>())).cnames as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceEKSegSum),
            "::",
            stringify!(cnames)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceEKSegSum>())).cdescrs as *const _ as usize },
        3376usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceEKSegSum),
            "::",
            stringify!(cdescrs)
        )
    );
}
pub type SpiceEKSegSum = _SpiceEKSegSum;
pub use self::_SpiceDataType as SpiceCellDataType;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SpiceCell {
    pub dtype: SpiceCellDataType,
    pub length: SpiceInt,
    pub size: SpiceInt,
    pub card: SpiceInt,
    pub isSet: SpiceBoolean,
    pub adjust: SpiceBoolean,
    pub init: SpiceBoolean,
    pub base: *mut ::std::os::raw::c_void,
    pub data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout__SpiceCell() {
    assert_eq!(
        ::std::mem::size_of::<_SpiceCell>(),
        48usize,
        concat!("Size of: ", stringify!(_SpiceCell))
    );
    assert_eq!(
        ::std::mem::align_of::<_SpiceCell>(),
        8usize,
        concat!("Alignment of ", stringify!(_SpiceCell))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceCell>())).dtype as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceCell),
            "::",
            stringify!(dtype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceCell>())).length as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceCell),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceCell>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceCell),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceCell>())).card as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceCell),
            "::",
            stringify!(card)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceCell>())).isSet as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceCell),
            "::",
            stringify!(isSet)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceCell>())).adjust as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceCell),
            "::",
            stringify!(adjust)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceCell>())).init as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceCell),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceCell>())).base as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceCell),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceCell>())).data as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceCell),
            "::",
            stringify!(data)
        )
    );
}
pub type SpiceCell = _SpiceCell;
pub const _SpiceTransDir_C2F: _SpiceTransDir = 0;
pub const _SpiceTransDir_F2C: _SpiceTransDir = 1;
pub type _SpiceTransDir = ::std::os::raw::c_uint;
pub use self::_SpiceTransDir as SpiceTransDir;
pub const _SpiceCK05Subtype_C05TP0: _SpiceCK05Subtype = 0;
pub const _SpiceCK05Subtype_C05TP1: _SpiceCK05Subtype = 1;
pub const _SpiceCK05Subtype_C05TP2: _SpiceCK05Subtype = 2;
pub const _SpiceCK05Subtype_C05TP3: _SpiceCK05Subtype = 3;
pub type _SpiceCK05Subtype = ::std::os::raw::c_uint;
pub use self::_SpiceCK05Subtype as SpiceCK05Subtype;
pub const _SpiceSPK18Subtype_S18TP0: _SpiceSPK18Subtype = 0;
pub const _SpiceSPK18Subtype_S18TP1: _SpiceSPK18Subtype = 1;
pub type _SpiceSPK18Subtype = ::std::os::raw::c_uint;
pub use self::_SpiceSPK18Subtype as SpiceSPK18Subtype;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SpiceDLADescr {
    pub bwdptr: SpiceInt,
    pub fwdptr: SpiceInt,
    pub ibase: SpiceInt,
    pub isize_: SpiceInt,
    pub dbase: SpiceInt,
    pub dsize: SpiceInt,
    pub cbase: SpiceInt,
    pub csize: SpiceInt,
}
#[test]
fn bindgen_test_layout__SpiceDLADescr() {
    assert_eq!(
        ::std::mem::size_of::<_SpiceDLADescr>(),
        32usize,
        concat!("Size of: ", stringify!(_SpiceDLADescr))
    );
    assert_eq!(
        ::std::mem::align_of::<_SpiceDLADescr>(),
        4usize,
        concat!("Alignment of ", stringify!(_SpiceDLADescr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDLADescr>())).bwdptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDLADescr),
            "::",
            stringify!(bwdptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDLADescr>())).fwdptr as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDLADescr),
            "::",
            stringify!(fwdptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDLADescr>())).ibase as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDLADescr),
            "::",
            stringify!(ibase)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDLADescr>())).isize_ as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDLADescr),
            "::",
            stringify!(isize_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDLADescr>())).dbase as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDLADescr),
            "::",
            stringify!(dbase)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDLADescr>())).dsize as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDLADescr),
            "::",
            stringify!(dsize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDLADescr>())).cbase as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDLADescr),
            "::",
            stringify!(cbase)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDLADescr>())).csize as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDLADescr),
            "::",
            stringify!(csize)
        )
    );
}
pub type SpiceDLADescr = _SpiceDLADescr;
pub type ConstSpiceDLADescr = SpiceDLADescr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SpiceDSKDescr {
    pub surfce: SpiceInt,
    pub center: SpiceInt,
    pub dclass: SpiceInt,
    pub dtype: SpiceInt,
    pub frmcde: SpiceInt,
    pub corsys: SpiceInt,
    pub corpar: [SpiceDouble; 10usize],
    pub co1min: SpiceDouble,
    pub co1max: SpiceDouble,
    pub co2min: SpiceDouble,
    pub co2max: SpiceDouble,
    pub co3min: SpiceDouble,
    pub co3max: SpiceDouble,
    pub start: SpiceDouble,
    pub stop: SpiceDouble,
}
#[test]
fn bindgen_test_layout__SpiceDSKDescr() {
    assert_eq!(
        ::std::mem::size_of::<_SpiceDSKDescr>(),
        168usize,
        concat!("Size of: ", stringify!(_SpiceDSKDescr))
    );
    assert_eq!(
        ::std::mem::align_of::<_SpiceDSKDescr>(),
        8usize,
        concat!("Alignment of ", stringify!(_SpiceDSKDescr))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDSKDescr>())).surfce as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDSKDescr),
            "::",
            stringify!(surfce)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDSKDescr>())).center as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDSKDescr),
            "::",
            stringify!(center)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDSKDescr>())).dclass as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDSKDescr),
            "::",
            stringify!(dclass)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDSKDescr>())).dtype as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDSKDescr),
            "::",
            stringify!(dtype)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDSKDescr>())).frmcde as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDSKDescr),
            "::",
            stringify!(frmcde)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDSKDescr>())).corsys as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDSKDescr),
            "::",
            stringify!(corsys)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDSKDescr>())).corpar as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDSKDescr),
            "::",
            stringify!(corpar)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDSKDescr>())).co1min as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDSKDescr),
            "::",
            stringify!(co1min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDSKDescr>())).co1max as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDSKDescr),
            "::",
            stringify!(co1max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDSKDescr>())).co2min as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDSKDescr),
            "::",
            stringify!(co2min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDSKDescr>())).co2max as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDSKDescr),
            "::",
            stringify!(co2max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDSKDescr>())).co3min as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDSKDescr),
            "::",
            stringify!(co3min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDSKDescr>())).co3max as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDSKDescr),
            "::",
            stringify!(co3max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDSKDescr>())).start as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDSKDescr),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceDSKDescr>())).stop as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceDSKDescr),
            "::",
            stringify!(stop)
        )
    );
}
pub type SpiceDSKDescr = _SpiceDSKDescr;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SpicePlane {
    pub normal: [SpiceDouble; 3usize],
    pub constant: SpiceDouble,
}
#[test]
fn bindgen_test_layout__SpicePlane() {
    assert_eq!(
        ::std::mem::size_of::<_SpicePlane>(),
        32usize,
        concat!("Size of: ", stringify!(_SpicePlane))
    );
    assert_eq!(
        ::std::mem::align_of::<_SpicePlane>(),
        8usize,
        concat!("Alignment of ", stringify!(_SpicePlane))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpicePlane>())).normal as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpicePlane),
            "::",
            stringify!(normal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpicePlane>())).constant as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpicePlane),
            "::",
            stringify!(constant)
        )
    );
}
pub type SpicePlane = _SpicePlane;
pub type ConstSpicePlane = SpicePlane;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SpiceEllipse {
    pub center: [SpiceDouble; 3usize],
    pub semiMajor: [SpiceDouble; 3usize],
    pub semiMinor: [SpiceDouble; 3usize],
}
#[test]
fn bindgen_test_layout__SpiceEllipse() {
    assert_eq!(
        ::std::mem::size_of::<_SpiceEllipse>(),
        72usize,
        concat!("Size of: ", stringify!(_SpiceEllipse))
    );
    assert_eq!(
        ::std::mem::align_of::<_SpiceEllipse>(),
        8usize,
        concat!("Alignment of ", stringify!(_SpiceEllipse))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceEllipse>())).center as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceEllipse),
            "::",
            stringify!(center)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceEllipse>())).semiMajor as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceEllipse),
            "::",
            stringify!(semiMajor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_SpiceEllipse>())).semiMinor as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_SpiceEllipse),
            "::",
            stringify!(semiMinor)
        )
    );
}
pub type SpiceEllipse = _SpiceEllipse;
pub type ConstSpiceEllipse = SpiceEllipse;
extern "C" {
    pub fn appndc_c(item: *mut ConstSpiceChar, cell: *mut SpiceCell);
}
extern "C" {
    pub fn appndd_c(item: SpiceDouble, cell: *mut SpiceCell);
}
extern "C" {
    pub fn appndi_c(item: SpiceInt, cell: *mut SpiceCell);
}
extern "C" {
    pub fn axisar_c(axis: *mut ConstSpiceDouble, angle: SpiceDouble, r: *mut [SpiceDouble; 3usize]);
}
extern "C" {
    pub fn badkpv_c(
        caller: *mut ConstSpiceChar,
        name: *mut ConstSpiceChar,
        comp: *mut ConstSpiceChar,
        size: SpiceInt,
        divby: SpiceInt,
        type_: SpiceChar,
    ) -> SpiceBoolean;
}
extern "C" {
    pub fn bltfrm_c(frmcls: SpiceInt, idset: *mut SpiceCell);
}
extern "C" {
    pub fn bodc2n_c(
        code: SpiceInt,
        namelen: SpiceInt,
        name: *mut SpiceChar,
